{"test 3":"content","Local manufacturers lambast NBE for revised Suppliers’ credit facility":"Metal, engineering and chemical manufacturers have voiced their displeasure over the recently revised National Bank of Ethiopia’s (NBE) Suppliers Credit Facility.\r\nAccording to NBE, the most recent revision of the directive is made in view of easing the foreign currency shortage which has a debilitating effect on the manufacturing sector in Ethiopia. However, the revised directive has redirected the Suppliers’ Credit Facility to Foreign Direct Investment firms invested in the manufacturing sector in Ethiopia.\r\nDuring a meeting chaired by the deputy Prime Minister Demeke Mekonnen on the sidelines of the Manufacturing Industry Exhibition, members of the sectoral association have discredited the central bank for introducing a basically segregating directive and a skewed hard currency allocation mechanism.\r\nThe local industrialists have urged Demeke not only to curb NBE’s directive but also introduce Franco-Valuta and suppliers’ credit facility to local manufacturers.\r\nIn addition to that, manufacturers have requested for priorities in accessing bank loans, to see the reduction of the current loan interest rates which they have claimed seeing in 16 to 18 percent interest rates. They have echoed for having lack of access to essential inputs, land and lack of workable tax and duty privileges.","Abiy assures Al Amoudi's release":"Prime Minister Abiy Ahmed (PhD) announced today that he has discussed the release of jailed Ethiopian-born Saudi Arabian Sheik Mohammed Al Al Amoudi with the Saudi Crown Price Mohammad Bin Salman and said that he got positive response.\r\n“We have requested 10 things from the Saudi Crown Prince and nine of them got acceptance by the crown prince. The one unanswered request was Al Amoudi’s release; but I can assure you that he will come home soon,” he said to a gathering at the Millennium Hall.\r\nAbiy said that Al Amoudi did not return from Saudi along with the PM because of the influence of the family of the crown prince. But, he assured he will soon be released.","Berbera Port expansion project to commence in September":"Ethiopia’s 30% goods to be shipped via Somaliland\r\nAfter forming a tripartite port development agreement with the United Arab Emirates (UAE) and Ethiopia, the Government of Somaliland, which is yearning to gain an international recognition, has made arrangements to commence the construction of new port facilities at the Port of Berbera.\r\nDuring a visit to the Port of Berbera – 154 kilometers out of the capital Hargeisa – Ali Ismail Mohamed, head of port operations with the UAE based DP World Group told Ethiopian journalists that the new tripartite port development project is set to take effect.\r\n“The construction of the first phase begins in September and bids will be awarded to potential developers,” the operations head said.\r\nAs per the timeline, the port project is expected to be finalized by 2020. The port facility, which currently has the capacity to handle 150,000 container port traffic (TEU: 20-foot equivalent unit), is expected to expand into handling one million TEU of 20 and 40-foot mixed units.\r\nThe Somaliland Port Authority has already consolidated port management operations and let DP World acquire positions in the management and operational activities at the existing port facilities. The USD 442 million port, according to Mohamed and his team, will be developed in two phases. During the first phase of development, both Mohamed and Allan Sanchez – project operations manager with DP World at the Berbera Port – said that a 430 meter berth is expected to be constructed which will accommodate two vessels at any given time.  The overall expansion project will bring about a total of 800 meter wide berth that can dock five ships at a time. The existing port facility accommodates five major vessels on a 650 meter long berth.\r\nIn case of Ethiopia’s involvement, it is hard to find out how the government is taking part in the development activities. Given its 19 percent stake at the port, Ethiopia looks at shipping some 30 percent of its import/export trades. Close to 10 percent of the total volume of shipment will be directed to Port Sudan. Some 95 percent of the country’s international trade currently passes through the Port of Djibouti.\r\nThe expansion project as commentators argue not only provides port services but creates additional milestone in the struggle for recognition as an independent nation.\r\nHowever, the project is seen as a threat by the Somalia and Djiboutian authorities. Somalia opposed the project claiming it has violated its sovereignty while Djibouti didn’t like Berbera Port becoming a potential contender as it takes a considerable share of volume from what it currently enjoys.\r\nAccording to the tripartite agreement, DP World holds on to a 51 percent share and Somaliland remains with 30 percent stake. Back in 2016, the initial deal was signed between UAE and Somaliland; that the former agreed to develop and manage the port with its own financial coffers. Somaliland will not be required to contribute in financial terms as the land and the seaport it availed is considered as an investment in kind.\r\nWhen asked what it means to have a 19 percent stake at the Berbera Port? Mekonnen Abera, director general of the Ethiopian Maritime Authority said that such details will not be necessarily disclosed for the time being.\r\nIt is unclear whether Ethiopia’s willingness to provide electricity to Somaliland is part of the port project deal. Mekonnen commented on a road project Ethiopia built that stretches to the border of Somaliland and this should not be mixed with the port project agreement. He stressed that the road projects are separately considered as parts of trade routes and corridors for development.\r\nAs the expansion of the Berbera Port weighs in, the existing port has become instrumental in handling general and containerized cargos. Somaliland has already built a container strip close to the ship main yard named Wuchale. It was named after a historical place in Ethiopia. Some of the general cargos which the Berbera Port handles include 25,000 tons of food aids. According to port officials this volume is expected to climb to 40,000 tons this year.","MPs question appointment of diplomats":"Members of the House of Peoples’ Representatives (HPR) raised questions regarding the competency of newly appointed ambassadors and heads of mission of Ethiopia’s diplomatic outposts, most of whom were unseated from government executive offices.\r\nHowever, Ministry of Foreign Affairs (MoFA) defended the appointees while admitting the need to review the whole appointment procedure.\r\nIn his appearance before Parliament on Tuesday, Workeneh Gebeyehu (PhD), Minister of Foreign Affairs (MoFA), however, did not deny the prevailing outstanding issues such as concerns of fairness and luck of transparency. He as well has underlined the need for procedural revision.\r\nDuring the 25th regular session of the parliamentary year, Workneh presented his office’s nine-month performance report before the House while MPs raised various questions related to the ministry’s activities as well as the country’s diplomacy.\r\nAmong the questions that were raised by members of the Foreign Relations Affairs Standing Committee of the House the appointment of new ambassadors and diplomats who are not career diplomats but picked by the government after being expelled from other ministerial offices.\r\nThe standing committee further raised the issue of fairness, transparency, legitimacy as well as qualification of diplomats appointed and posted at embassies and consulate offices abroad.\r\nThe minister recognized two established trends of appointment of diplomats. One is assigned career diplomat from within the ministry and the other is appointment coming from the government.\r\nBut the retired officials, when they are appointed for diplomacy, they come with the experience and leadership quality they have acquired during their tenure as an executive.\r\nThough it is the responsibility of the Prime Minister and the President to appoint an ambassador, the ministry also has a responsibility to generate regulations and guidelines and to make proposals to the government.\r\nHe also noted that consultation is underway with the Office of the Prime Minister regarding the appointment procedures as well as other related tasks.\r\nHence, according to the minister, once the guideline is concluded, senior government officials can only be assigned for diplomatic responsibility based on their track record and what they achieved while they were in office.","Bunge offers lowest price for wheat purchase":"Bunge S.A–Switzerland-based trading company–has managed to give a lowest offer of 286 million birr for the supply of 35,000 metric tons of wheat, The Reporter has learnt.\r\nThe wheat is planned to be acquired as part of the government’s and donor’s effort to support those who are under The Fourth Productive Safety Net Program.\r\nThe Public Procurement & Property Disposal Service (PPPDS) floated the tender on behalf of the Ministry of Agriculture & Livestock.\r\nIn this respect, among eight wheat suppliers in the international grain market, which have bought the tender document, only three submitted their offers.\r\nThe bid for the supply of 35,000 metric tons of wheat was divided into two lots, each with 17,500 metric ton lots. In this regard, Bunge S.A gave the lowest prices of USD 295 and USD 299 per ton for each lot.\r\nThe bid was opened on May 17, 2018, at the PPPDS’s premises located off King George VI Street.\r\nThe two lots are set to be distributed among two different warehouse destinations in Adama and Komobolcha.\r\nIn this respect, the second lowest offer came from Hakan Agro DMCC–a UAE based company—which listed the lowest price of USD 297.77 per one metric ton for Lot 2 to be delivered at Kombolcha Warehouse.\r\nIn addition, the third lowest offer of USD 299 dollars (for Lot 1) came from Bunge.\r\nThis time around, Promising International gave USD 301.45 and USD 302.45 per ton, for both lots.\r\nThe latest wheat purchase will be the second biggest in terms of size in the past six months.\r\nIt is to be recalled that six months ago, Ethiopia purchased 400,000 metric ton of wheat to feed close to 5.4 million people out of the 8.5 million people affected by drought.\r\nIn related news, the Service has decided to extend the bid opening date of the controversial wheat purchase, amounting 400,000 metric ton, by one week. The Service has also downsized the purchase amount from 400,000 metric ton to 200,000 metric ton.\r\nIn return, PPPDS awarded Promising half the amount from the 400,000 metric ton which amounts to a total price of 1.64 billion birr.                                                                                                                                                                                                                                                                                              ","WB calls on gov’t to give attention to service sector":"The World Bank Group (WBG) urged the Government of Ethiopia to give proper attention to the service sector of the country, especially to the distribution services, in its sixth Ethiopian Economic Update launched on Wednesday May 18, 2018, at the Hilton Addis Ababa.\r\nThe report dubbed “The Inescapable Manufacturing – Services Nexus: Exploring the Potential of Distribution Services” indicated that, although the country’s economy is expanding, the services sector is growing fast despite the priority the government has set to support the manufacturing sector. The Economic Update indicated that the Gross Domestic Product (GDP) in the June 2016 - 2017 Fiscal Year was estimated to have registered a 10.9 percent growth.\r\nThe Report also argued that, at less than 10 percent of the GDP, the country’s export sector is quite small for a country of Ethiopia’s level of growth.\r\n“The performance of the services sector is an important indicator of the performance of the economy as a whole and the export sector in particular. Yet, many modern services remain underdeveloped in Ethiopia,” indicates the Report.\r\nFor Abraham Tekeste (PhD), minister of Finance and Economic Cooperation (MoFEC), an export intake of three billion dollars for a country that is growing at this pace is not acceptable too. And because of the failing export revenue, the country is shifting its attention from loans to joint financing schemes of projects by the public and the private sectors.\r\n“This export underperformance has undermined the capacity of the country to borrow; we aim to focus on the private sector now,” Abraham told The Reporter.\r\nAs services export is also a major contributor to the country’s earnings and of the country’s GDP growth, the WB recommended that the government should give more attention to the growth of the Services sector.\r\nAbraham begs to defer, saying that “the country’s primary focus is still on the manufacturing industry”.\r\n“Ethiopia cannot just leapfrog to the service sector. Not yet. Industrialization remains an indispensable path for Ethiopia given its critical role in productivity growth, job creation, skills, job creation, skills and technological accumulation, and sustained export development,” Abraham stated.\r\nHowever, Atlaw Alemu (PhD), Head of the Economics Department at Addis Ababa University, says that the growth of the services sector is not something one should boast about. He says this sector is taking resources away from the productive sectors and that it is unhealthy growth; it has to be rectified by policy intervention.\r\nEven though by whatever means the service sector has grown, the growth by itself is something to celebrate, for Abebe Abebayehu, the deputy commissioner at the Ethiopian Investment Commission.\r\n“It contributes significantly to the economy and Forex earnings. As long as the service sector is helping the growth of the manufacturing sector, there is no problem,” Abebe argued at the panel discussion held during the launching of the WB report.\r\nSimilarly, Abraham appreciates the growth of the service sector. “But, the question is how to make it productive and competitive and make it support the manufacturing sector,” he says.\r\nHe also says that all services including the Transport and Distribution sectors should support the manufacturing sector; however, Abraham argues that caution must be exercised not to put undue pressure on the manufacturing by the growth of the services sector as the latter gets higher values than the manufacturers for just giving the services.\r\nThe WB’s economic update, however, indicates that the distributive services in the country have grown over the past decades despite several factors that jeopardized its potential to contribute more directly or indirectly to Ethiopia’s export performance.","Global investors show interest in Solar":"Lighting Africa–part of World Bank’s efforts to developing a commercial off-grid lighting market in the continent–held its second Lighting Africa/Ethiopia off-grid gathering at Intercontinental Hotel, in the capital, on Thursday. The two-day gathering saw a slew of international businesses take part, showing an interest in the solar energy market within Ethiopia.\r\nTaking part this year were solar manufacturers, investors, financial institutions and high-level delegations from the local industry and a number of countries across the globe. Mobisol, All Slar, Oh Slar, Green Light Planet and Sunking were some of the companies represented. Discussions were held on the custom procedures of the nation, on quality standards and access to finance.\r\nAmong the companies that were at the gathering, the Berlin-based Mobisol is known to have ventured into the continent offering affordable off-grid solutions to an estimated population of half-a-million in the region alone via a mobile payment plan.\r\nThe World Bank estimates that more than 500 million Africans lack basic electricity and the vast majority is not connected to the power grid.\r\nThe World Bank is behind a microfinance scheme plan to encourage farmers to use solar energy and make it affordable to attain it with an affordable loan of up to 75% and a time frame to pay back within 2 years. This is arranged with a phone payment plan using M-Birr.\r\nFor Lighting Africa, the effort for them is to help mobilize “the private sector to develop sustainable markets that provide affordable, modern off-grid lighting products and systems to communities across Africa that are not connected to grid electricity.”\r\nThe Ethiopian arm of Lighting Africa began in 2015 and it has so far enabled 1.1 million people meet their basic electricity needs through the purchase of 1.4 million quality-verified products, a growth that has been achieved through the involvement of government institutions, the private sector and the vast population.\r\nThe African continent–with the lowest electric power infrastructure in the world—has seen a promising start for solar energy entrepreneurs. With a friendly natural sunlight environment, the continent is seen as one that has not taken advantage of its favorable environment.\r\nThe latest local enterprise looking to enter the solar market is Samuel Tafesse of Sunshine Construction, who is said to plan and build a solar park with Orchid Business Group at a cost of USD 120 million.","Gov’t sets up public-private partnership directorate":"Faced with an increasingly difficult external debt levels and hence difficulty to access foreign finance, Ministry of Finance and Economic Cooperation established a Public Private Partnership (PPP) Unit for the implementation of the recently passed PPP proclamation, The Reporter learnt.\r\nIt was on July 7, 2017 that the House of Peoples’ Representatives (HPR) passed the proclamation which provides for the development of projects in the PPP scheme. Since then, the establishment of a unit at the Ministry was awaited as it is the one that identifies sectors to be developed in the PPP scheme, present to the board for approval and float tenders for interested bidders to invest in the identified sectors.\r\n“Export is underperforming continuously and our capacity to borrow is becoming increasingly limited,” Abraham Tekeste (PhD), the Minister of Finance and Economic Cooperation (MoFEC), told The Reporter. “And there are critical public investments that we are not willing to compromise.”\r\nForeign exchange earnings and allocation have been at the center of the concern both for the private sector and the state, which Abraham also shares. For him, the acute shortage in the foreign currency primarily originated from the dwindling export earnings.\r\n“For an economy that is growing more than 10 percent, three billion dollars of export earning is very small,” Abraham stands.\r\nEthiopia earned 2.1 billion dollars in export revenue during the nine-month performance of the current fiscal year, 1.5 billion dollars less than the plan. Although the performance has shown a growth of 4.3 percent compared with the same period last year, it is still concerning for an economy that hugely depends on concessional and non-concessional loans to cover its financing needs.\r\nBecause of the highly concerning fall in export performance, the government had devalued the birr by 15 percent, effective from October 11, 2017. But, the export performance of the export sector did not go according to plan.\r\n“The export began to increase because of the devaluation, but it did not increase to our expectation,” Abraham says. “Had it not been for Khat and Gold, the export performance would have increased by more than nine percent,” he argues.\r\nBut, recently, Ethiopia has stopped exploiting its sources of non-concessional loans because of the pressure from the accumulation of external debt; due to servicing burdens and, partly, because of the push from development partners like the World Bank (WB) and the International Monetary Fund (IMF).\r\nSimilarly, the country’s outstanding foreign debt level has been piling on, growing from 23.5 billion dollars in 2016/17 to 24.2 billion dollars by September 30, 2017, according to MoFEC’s Public Sector Debt statistics Bulletin. Out of this, the 13.5 billion is the share of the central government while the share of government guaranteed and non-government guaranteed loans stand at 7.1 billion dollars and 3.6 billion dollars, respectively.\r\nRecent reports show that Ethiopia’s risk of external debt distress was downgraded from “moderate” to “high” in the 2017 DSA following the significant and protracted breach of two external debt burden thresholds.\r\nHence, in order to finance the “critical” public investments, the government has now turned to PPP, which is also in line with the WB’s recommendation of crowding in the private sector.\r\n“We aim to focus on and exploit the private sector for which we have established a PPP unit at our Ministry,” Abraham said.\r\nThe PPP proclamation provides for the government to establish a unit at the MoFEC, which will serve as the secretariat of the PPP board that oversees the performance of scheme. The board will be composed of representatives from MoFEC, also chair of the board, the National bank of Ethiopia, the Ministry of Water, Irrigation and Electricity, The Ministry of Transport, The Ministry of Public Enterprises, The National Planning Commission, the Ministry of Federal and Pastoralist Affairs and other two from the private sector.\r\nThen, the unit at the Ministry will identify the sectors to be developed through PPP and get it approved by the board to then go to study feasibility of developing the selected sectors through PPP. Then, the developer which will partner with the government will be the winner of the bid.\r\n ","Palestine opts for AU, Ethiopia to mediate Israel quandary instead of US":"The Palestinian Ambassador to Ethiopia, Nasri Abujaish (PhD), called on Ethiopia and the African Union to engage in peace talks with Israel, as his country will no longer accept the US as a neutral negotiator after the US Embassy opening in Jerusalem.\r\nThe Ambassador announced this during a press conference held on the 15th of May 2018, to condemn the opening of the US embassy in Jerusalem.\r\n“Ethiopia’s relation with the Arab world as well as being the seat of the African Union and the political capital of the continent; we accept Ethiopia as a negotiator in the peace talks,” Abujaish said.\r\nIt was on Monday, May 14, 2018 that the US opened its embassy in Jerusalem affirming the December 2017 recognition of Jerusalem as the capital of Israel by president Donald Trump. Despite a huge push from the US, a resolution at the United Nations General Assembly to nullify US’s recognition of Jerusalem as the capital of Israel passed with 128 nations voting in favor of the resolution. Ethiopia was among the countries that voted in favor of the resolution.\r\n“We thank Ethiopia for every support it has been providing since the early days at the UN and we expect them to carry-on their support in the future,” Abujaish said.\r\nAbujaish also indicated that the measure of the US to recognize Jerusalem and move its embassy was in full transgression of the UN resolutions that provided for the fate of Jerusalem be solely decided upon by an agreement between Palestine and Israel.\r\n“We consider the act by the US as a colonial occupation of a sovereign nation and it is against all the UN Security Council and General Assembly resolutions,” he said.\r\nTo the maximum, the UN resolutions acknowledge that Jerusalem can serve as a capital for both Palestine and Israel given the two nations agree to sit on the eastern and western part of the city of Jerusalem.\r\nBut, as the western part of the city is rich in historical sites; Islamic, Jewish and Christian and a walled ancient city, both claim belongingness of that section of Jerusalem. And Israel’s continuous settlement programs in west bank and Gaza have sparked conflicts and death of innumerable number of civilians.\r\nIn its meeting held following the decision of the US to move its embassy from Tel Aviv to Jerusalem, the Arab League condemned the decision by the US. Speaking at the League, King Salman of Saudi Arabia also condemned the act by the US and pledged USD 150 million for the restoration of Islamic heritages in Western Jerusalem.","Former UN expert urges ADLI reinstatement":"The once famously quoted and the much talked about Agricultural Development Led Industrialization (ADLI) strategy the Government of Ethiopia introduced to drive the economic development of the country now remains in shadows and a former UN expert urged the strategy to be reintroduced and practiced for the benefit of smallholder farmers.\r\nLaunching his book on Wednesday titled “Overcoming agricultural and food crises in Ethiopia,” Getachew Diriba (PhD) — an Ethiopian agricultural economist — said that Ethiopian officials need to reconsider the significance of a strategy that embraces agricultural development together with industrial activities.\r\nAccording to Getachew, Ethiopia’s smallholder farming communities face serious life-threatening challenges when it comes to having access to basic necessities.\r\nThe Ethiopian agriculture as pointed out in his book fails to provide five essential requirements. The first major requirement agriculture found out to be lacking is food and necessary consumables. There are close to seven million rural households that represent 40 percent of the whole rural households “fall short of food consumption requirements at the most basic level and face perpetual food crisis,” Getachew writes.\r\nIn addition, according to Getachew, 11 million (63 percent) rural households are impotent to cover food and necessary family expenditures. Those households who are unable to face agricultural risks, unable to spend on inputs and contingencies make up 15 million or 86 percent of the rural households of Ethiopia.\r\nIn His thought provoking book, Getachew claims that Ethiopia’s smallholder farmers deserve to have enhanced agricultural tools and farm equipment. He argues the vast majority of farmers in Ethiopia subsist on “Neolithic tools” which should have been kept in museums by now.\r\nGetachew said that to make agriculture more effective and transformed, strategies such as ADLI should be reconsidered to induce mechanized farming and innovative agriculture in Ethiopia, Getachew calls. “ADLI was designed as a long-term strategic framework to achieve faster agricultural growth and broader economic development by relying on labor intensive technologies, the consolidation of land, and the wide spread use of fertilizers and improved seeds.” This strategy which targets facilitations of extensions, micro and small credits, trainings and the like as Getachew urges need to be reemerged in the policy environment.  \r\nHowever, across the years, the government’s trial and error of economic policies and strategies – narrated in Getachew’s book — have done very little to alleviate millions from the brink of crises.\r\nThe book was launched by Shiferaw Shigute, Minister of Agriculture and Livestock and prominent agricultural experts have forwarded reviews and critics on the contents and arguments Getachew has portrayed on Ethiopia’s backward farming activities.\r\nAn agricultural economist by training, Getachew has more than three decades of accumulated field and research experience. Before he retired in 2017 from his post as United Nations World Food Program (WFP) country director and representative to China, he was able to establish China Center of Excellence for WFP. Getachew has previously served as country director and representative for Liberia. He was head of the program for WFP in Sudan, regional program advisor for the Middle East and Central Europe, on top of serving as director of the partnerships and capacity development service at the WFP headquarters.\r\nApart from his career at the WFP, Getachew worked for CARE International and CARE Ethiopia prior to his foreign civil service career.","Andargachew et al to get presidential reprieve ":"Andargachew Tsgie, aka Andy–a member and founder of the outlawed Ginbot 7 political organization and a British citizen– is among the list of convicted and charged prisoners submitted by the Federal Office of Attorney General to the President of the Republic for a pardon, The Reporter has learnt.\r\nSource close to the matter disclosed to The Reporter that President Mulatu Teshome has already approved the pardon request from the Office, late Friday, May 25, 2018, according to same sources.\r\nAndargachew who was the secretary general of Ginbot 7, was in an undisclosed confinement center since 2014. He was believed to be abducted by Ethiopian security agents in Yemen, Sana and brought to Ethiopia.\r\nSince then, there have been a social media campaign from the opposition camp and particularly his party.\r\nAndargachew, married to a British citizen Yemserach Hailemariam, is a father of three. In his earlier political life, he was part of the EPRDF led government in the early 1990’s following the overthrow of the Derg regime.\r\nIn a related news, the Office of the Attorney General has also requested the court case of officials and business personalities convicted and charged with corruption a while back to be dropped completely.\r\nThis includes the former director general of Ethiopian Revenues & Custom Authority, Melaku Fanta and his deputy Gebre Wahed G. Gorgis. Business personalities include Getu Geleta (in exile), Nega G Egizabher, Ketema Kebede.\r\nIn addition, officials as well as businessmen who were part of the recent government corruption crackdown are also included in the list of personalities to receive the pardon. This includes former state minister of Finance and Economic Cooperation, Alemayehu Goju and associates.\r\nThe Office, in a press briefing scheduled for today, is expected to disclose the list of names included in the pardon.","Water Fund concludes fiscal year funding 16 towns with 700 mln birr":"Reaches 100 towns with 10 billion birr\r\nThe Water Resources Development Fund (WRDF) has concluded the current Ethiopian fiscal year by availing more than 700 million birr loan to 16 rural towns in order to scale up the availability of running water in the country.\r\nSigning the credit facilities with representatives of 16 towns, Wana Wake, director general of WRDF said that the overall of financing that has been provided to small rural towns has reached to be more than 10 billion birr with the number of towns reaching more than 100 in recent months.\r\nBack in March alone, the state run WRDF has been able to extend 1.1 billion birr concessional loan, registering some nine billion birr via co-financing deals for 92 projects. That figure has now reached to hit more than 10 billion with the outreach of 100 projects including the 16 towns that have agreed to develop potable water projects within 12 months of\r\nEstablished 15 years ago, WRDF has only been able to pump huge amounts of funding this past two to three years. Backed by the World Bank Group (WBG), the European Investment Bank (EIB), the French Development Agency (AFD), the Italian Development Agency (AICS) and the like, WRDF finances projects focused on sanitary and hygiene. It is to be recalled that the WBG last year extended USD 450 million that would reach 22 towns including Addis Ababa for projects that will focus on waste water treatments.","Assela wind farm acquires financing":"Ethiopia and Denmark have signed a loan agreement where the later will provide finance in order of USD 201 million for the construction of the Assela Wind Farm.\r\nThe agreement was signed this week between Ambassador Mette Thygesen of Denmark and Admasu Nebebe, state Minister of Finance and Economic Cooperation (MoFEC).\r\nThe USD 201 million in finance will be provided by the Danish International Development Agency which will be directly injected to Assela wind farm project.\r\nOnce it is completed, Assela wind farm is expected to generate 100 MW power and its construction is expected to commence as of this year and will last until 2025.\r\nThis would result in increased potential for access to affordable, reliable and modern energy for Ethiopia, said a concept paper of the project presented in 2017. According to the paper, the farm is anticipated to produce 330,000 kWh per year-the equivalent of electric power supply to approximately 500,000 persons at a cost of less than € 0.09 per kWh.\r\nThe paper has also identified some social and environmental concerns that need to be addressed once the project commences offically.\r\n“Risks and assumptions relating to land issues have been identified. The feasibility study included an environmental and social impact assessment conducted in consultation with authorities and the community. Whereas there would be some permanent negative impact relating to noise and destruction of habitat of some fauna at the site of the project–an area of around 30 to 50 hectares,” reads the paper.\r\n“The major risk relates to the need for acquisition of this land and resettlement of some 20 to 30 households which depend on the land for their livelihood.”  \r\nThe project is part of the Ethiopian government’s plan to increase its electricity power generation from the current 4,200 MW to about 17,250 MW by 2020. The power mainly will come from using hydro, wind, geothermal, biomass and solar energy.\r\nIn this regard, 1,224 MW is expected to come from wind farms.","Philips to build first specialized cardiac care center":"The Government of Ethiopia has signed a deal with the Netherland-based Philips – the world’s brand name leader in health technology – to build the nation’s first specialized cardiac care center in the capital at a cost of EUR 40 million.\r\nThis is to be a milestone moment for the country, which has one of the world’s highest prevalence of rheumatic heart disease and a dire need for cardiology care.\r\n“We want to transform cardiology care in Ethiopia and in Philips we have a strong partner that understands our requirements,” Ethiopia’s new Minister of Health, Amir Aman (MD) said at a memorandum-of-understanding ceremony in the capital.  “Philips is able to provide a comprehensive hospital solution for state-of-the-art diagnosis and treatment of cardiac diseases, including capability building and skills transfer.”\r\nPhilips is to take the lead in the full turnkey design, construction, equipping and in the commissioning of the location of the hospital as well as train the staff and be responsible in the maintenance of medical equipment’s. The new hospital is to be located within the compounds of the publicly-owned hospital, Tikur Anbessa Hospital and will have a state-of-the-art facility.\r\n“This is a unique project for Philips globally as we are creating an entire turnkey hospital solution,” Jasper Westerink, CEO of Philips Africa, said. “Drawing on more than 125 years of Philips experience on the African continent, paired with our expertise in holistic healthcare planning and hospital design, as a strategic partner (of Ethiopia) in developing and implementing an integrated approach to cardiovascular care that will enable improved treatment and outcomes for patients and clinicians.”\r\nFor Philips, this new initiative in Ethiopia follows its commitment in the areas of health care in the world having played an important role in the areas of maternal and child health through its Philips Healthcare initiatives.\r\nThe hospital will have the physical capacity to perform 500 surgeries, 1,600 lab diagnoses, and 500 lab interventions once it is operational in 2020.","Promising offers least price for wheat":"Promising International – a UK-based trading company – has managed to give the least offer of 1.39 billion birr for the supply of 200,000 metric tons of wheat, The Reporter has learnt.\r\nThis gave the company a chance to win its second bid of supplying 200,000 metric ton of wheat within two weeks. It is to be recalled that the Public Procurement and Property Disposal Service (PPPDS) awarded Promising 200,000 metric tons with a total price of 1.64 billion birr.       \r\nThe latest bid where Promising managed to give a lowest offer was part of a bigger tender where the government was looking for a company to supply 400,000 metric tons. In this regard, the Service floated an international bid almost six month ago.\r\nThe bid which was floated on behalf of Ministry of Trade was meant to be distributed for the purpose of market stabilization. Due to a prolonged controversy, the Service floated the tender three times.\r\nDuring, the first round of the bid, Shakeel and Company, a new supplier from Pakistan which was not familiar with the Ethiopian grain market gave a 2.6 billion birr lowest offer for the supply of 400,000 metric tons of wheat. However, this bid was later cancelled following a disagreement between the Company and the Service.\r\nMoreover, during the second round, Promising managed to offer 2.7 billion birr. However, the bid still ended up in controversy where it was said to be technically unfit.\r\nThese and related delays in the bidding process caused a nationwide shortage of wheat. This forced authorities to downsize the quota of wheat distributed across the country by almost 50 percent.\r\nFollowing this, the Service floated the tender for a third time in April 2018. However, within a few days it ended up amending the tender. In this regard, it downsized the initial 400,000 metric ton by half, in return the Service asked Promising to supply the rest of the 200,000-metric ton.\r\nThis adjustment done by the Service gave Promising the chance to supply the wheat with around 1.64 billion birr.\r\nThe latest bid which was opened on May 25, 2018, at the PPPDS premises located off King George VI Street attracted eight companies.\r\nThe tender divided in to two lots are set to be distributed among two different warehouse destinations in Adama and Komobolcha. In addition, during the bid process, all bidders are required to propose to ship the wheat either using their own vessel or using ships owned by Ethiopian Shipping and Logistic Services Enterprise (ESLSE).\r\nIn this respect, the first two lowest offers came from Promising—which listed the lowest price of USD 251.30 per one metric ton for Lot 1 and for Lot 2 with an amount of USD 254.8 if to be delivered by their own vessels. In addition, the company gave USD 258.05 and USD 262, per one metric ton if to be delivered using ESLSE vessels.\r\nFurthermore, the second lowest offer of USD 261 dollars (for Lot 1) came from Hakan Agro DMCC – a UAE based company to be delivered using its own vessel.\r\nThis time around, Hakan failed to give an offer for the second lot. During the price readout, the company instead of giving offers for the second lots, in the bid document it mistakenly wrote the offers made for the second lot as a third lot.\r\n“In the bid we only have two lots, said Solomon Betre,” head of Procurement at the Service. So, we are not going to read the offers listed below for the third lot.\r\nDuring the bid, a local company called Sabrina Transit PLC gave an offer which is far from the offers made by the rest of the bidders. The company gave an offer around 350 birr per ton which is unusual in comparison to previous experiences.\r\nThe Company also said that the 200,000 metric ton of wheat will be sourced locally. However, they failed to submit bid security document, compliance sheet documents as well as stamped legal documents.\r\nThis leaves Promising to be the lowest fit bidder.\r\n According an employee of the Service close to the bidding process said that “If the Service manages to float the 400,000 metric ton of wheat, instead of awarding the 200,000 metric ton with 1.64 billion birr to Promising, the government would have a chance to save at least around 210 million birr.”\r\nNow with the current least offer, Promising will have a chance to snatch 3.03 billion birr worth of wheat supply just in a few weeks.\r\nIt is to be recalled that the company has also won a bid to supply 200,000 metric ton of wheat for drought relief purposes last year with a cost of 1.64 billion birr.","Abyssinian Flight Services commences helicopter flights":"The pioneer charter flights operator, Abyssinian Flight Services (AFS), began providing charter helicopter flights with Bell 407 helicopter it recently acquired.\r\nThe company has been operating charter flight services with fixed wing aircraft since 1999. Solomon Gizaw (Capt.), managing director of AFS, told The Reporter that considering the growing demand for charter flight services his management has decided to introduce helicopter flight services. “With the fast economic growth the country is registering there is an enormous demand for charter helicopter flight services,” Solomon said.\r\nThe Bell 407 is a single engine Turbine, four blades, seven seat light utility helicopter produced by the US aircraft manufacturer, Textron Aviation. Bell 470 is equipped with the powerful Rolls-Royce/Allison 250-C47 turbo shaft engine that allows it to have an increase in takeoff weight and improved performance at hotter temperature and higher altitudes. The helicopter has standard seating for one crew and six passengers in a comfortable wide cabin. It can cruise at 140 knots and has a rage of 550km.\r\nSolomon said that the Bell 407 helicopter will be used by oil and gas companies, aid organizations and high profile tourists. The helicopter can be used for survey works, aerial photography and medical evacuation.\r\nAccording to Solomon, the Ethiopian government is undertaking mega construction projects in remote areas where there is no airport infrastructure. “Our new Bell helicopter can land anywhere. It can be used to supervise railway, dam or other major construction projects. Mining companies also can use the helicopter to monitor exploration work,” he said.\r\nTourists, brides and grooms and other leisure travelers can book helicopter flights. “If you take Ertale, it is a very popular tourist destination, but there is no airport near the site. So we can take tourists directly to the spot. There are also remote lodges in places like Semein Mountains where there is no airport. So I believe that launching the helicopter flight can contribute its share to the development of tourism in our country,” Solomon said. According to him, AFS is negotiating to acquire two more helicopters.\r\nAFS was established in 1999 providing charter flight services with a single Cessna aircraft. In 2007 it opened the first private pilot training school. Today the company operates a total of 17 aircraft – 16 fixed wing and one chopper. Ten of the aircraft are being operated by the Abyssinian Aviation Academy while the seven aircraft provide charter flight services.\r\n“Foreign operators come and make millions of dollars here in our country because of the unavailability of helicopters. So we are glad that now we can save flight of foreign currency,” Solomon said.\r\nSolomon comprehend the positive role the Ethiopian Civil Aviation Authority is playing in nurturing the indigenous general aviation industry. “They are exerting effort to grow the general aviation which can play a significant role in the economic development of the country. If we can get the proper support we can contribute immensely to the development of tourism, mining and construction sectors,” Solomon said.\r\nHe said that the local pilot training schools can train thousands of pilots and send them abroad. “It is better to export skilled labor and earn much bigger foreign currency than sending unskilled labor. We can generate billions of dollars.”\r\nHowever, there are a number of challenges the general aviation sector is facing. There is no dedicated airport for general aviation. The private operators are not allowed to build their own light aircraft maintenance hangars. Getting flight permit is also a daunting task.\r\n“For me the challenge is not about runway and terminal it is on peoples’ mind that we should work on. There is no understanding of general aviation in Ethiopia. Our government officials do not know the benefits of general aviation. We can play a crucial role in bringing and saving foreign currency and fostering the economic development.”\r\nSolomon said that the general aviation operators want to deliberate on the prospects and challenges of the home grown general aviation industry with the new leadership.     ","Ethiopia: The last Greeks of Addis Ababa":"Addis Ababa, Ethiopia - \"Did you know that Ethiopia gets its name from the Greek word Aethiopia, first used by Homer?\" Greek Ambassador to Ethiopia Nikolaos Patakias says proudly.\r\nSitting in his office in the capital Addis Ababa, Patakias shows an ancient Greek romantic novel, The Aethiopica. It's a love story about the relationship between the daughter of the queen of Ethiopia and a Greek descendant of Achilles.\r\nAlso in his possession are photographs of relics from the ancient Ethiopian Kingdom of Axum. These include the famous Ezana Stone and some gold coins, both of which have ancient Greek scripture written on them.\r\n\"Tradition counts for a lot in Ethiopia and Greece, we follow it by the book,\" says businessman Odysseas Parris, 57, sitting in a Greek restaurant close to the ambassador's residence.\r\n\"We're very lucky because we get to enjoy festivities from both cultures.\"\r\nAs he sips his frappe - Greek iced coffee - and his wife Anastasia Mitsopoulou smokes and talks expressively with friends, they are unmistakably Mediterranean.\r\nAnastasia Mitsopoulou and Odysseas Parris [Alice McCool/Al Jazeera]\r\n\r\nYet Parris and Mitsopoulou are two of Addis Ababa's second generation Ethio-Greeks. Both of Parris' grandfathers were Greek and grandmothers Ethiopian. He, and his parents before him, were born in Ethiopia.\r\nMitsopoulou's story is similar, though she is also part Italian. But being part of what are arguably two of the world's proudest and most ancient cultures isn't always easy, says Mitsopoulou, a teacher at the Greek Community School.\r\n\"Neither country really accepts us as one of them. In Greece we are Ethiopians, and in Ethiopia we are Greeks,\" she says with a sigh.\r\nGreek sailors and merchants began emigrating to Ethiopia in significant numbers in the late 1800s. It is likely some were refugees of the Greek Genocide, Greek Civil War, and later the military dictatorship.\r\nIn its heyday, the embassy here estimates the Greek community numbered between 5,000 and 6,000 people.\r\nInfluential members of society\r\nEleni Tsimas, 80, is at the Greek Orthodox Church in Piazza, Addis' old Italian quarter. Although an ethnic Greek, Tsimas was born in Ethiopia to parents who ran a small business. Asked if she feels more Ethiopian or more Greek, she quickly replies, \"I am Ethiopian. In Greece I am a foreigner. What to do?\"\r\nFrom age 18, she worked at Bambis, a pharmacy, grocery and eventually supermarket owned by a rich Greek family who moved to Addis in 1890. In the subsequent decades, Greeks became influential members of Ethiopian society and were among the closest advisers to Haile Selassie, the Ethiopian emperor and Rastafarian messiah famous for resisting Italian dictator Mussolini's invasion.\r\n\"I met him many times, we'd go to the palace. He was something special. He would stop the car and give us golden coins,\" remembers Tsimas, who ended up marrying into the Bambis family.\r\nBut like thousands of other Greeks, the Bambis fled Ethiopia in the '70s following a revolution that overthrew the royal family, installing the Derg communist dictatorship that ruled the country from 1974 to 1987. With this came the nationalisation of all property and hostility towards foreigners, so most of the Ethio-Greek community left.\r\nThis included Tsimas and her husband. \"They came with guns to take over the shop, claiming it as public property,\" she recalls.\r\nEleni Tsimas [Alice McCool/Al Jazeera]\r\nAlways yearning to return to Ethiopia during their 20 years in Greece, after the Derg regime fell Tsimas' husband saw Bambis was up for auction and won the bid. Today, they run the supermarket together.\r\n\"I started at age 18 and at age 80 I am back again. Yesterday I worked from eight in the morning until eight in the evening. I always work. I even delivered my children in the grocery,\" Tsimas says with a chuckle.\r\nGreek community today\r\nOn the eve of Greek Independence Day there is a buzz in the Santorini Greek Restaurant as members and friends of the community drop in and out, frenetically discussing celebration plans. As everyone sits at one big table chatting, popcorn - made traditionally as part of Ethiopian coffee ceremonies - is brought as a snack to have with drinks. Greek salads, souvlaki and tzatziki soon follow.\r\nAround the table are second generation Ethio-Greeks, half-Ethiopian Greeks who have recently moved to Addis, and Ethiopians who are in some way connected to Greece through study, work or marriage.\r\nLater in the evening, Ambassador Patakias and his family swing by for dinner and to show off posters they have made for the celebration, set to be even bigger than usual this year. As well as a special ceremony at the Greek Orthodox Church, and a showcase of Greek dancing and poetry at the Greek Community School, an official party is being held at the Greek Club - and Alternate Foreign Minister for European Affairs George Katrougalos will be in attendance.\r\nThese institutions in the city are at the heart of the now 500-person small Greek community in Addis. But a number of those interviewed said infighting has left some Ethio-Greeks feeling excluded. Community leaders, some say, lead with an iron fist and resist change. Some spoke of financial disputes, others of backward attitudes, such as prejudice against Turkish people who came to play a friendly sports match at the Greek Club.\r\nGabriel Shebale, an Ethiopian doctor who lived in Athens for nearly 30 years, is a friend of the community. He agrees there are issues \"because they often only interact with each other, and are not the largest community. They develop a ghetto-like system. The infighting makes the community weaker,\" he says.\r\nThe new Ethio-Greeks\r\nBarbara Gembiaou owns the restaurant, which she runs with the help of her brother Filippos. Born in Greece but half-Ethiopian, Gembiaou moved to Addis eight years ago and set up Santorini shortly afterwards. Filippos followed a year later.\r\nBoth now have families in Ethiopia (new Ethio-Greeks) and they seem settled for now. Painted the Greek national colours of blue and white, the mainly al fresco restaurant full of dusty trinkets and old postcards has the homely feel of a Greek taverna.\r\nThe siblings are two of an increasing number of Greeks - some with Ethiopian heritage, others not - who moved to Ethiopia after the start of the Greek financial crisis in 2007. This is what brought back Shebale, the Ethiopian doctor, who said that with the crisis came increasingly negative attitudes towards foreigners.\r\nMeanwhile, the embassy is encouraging Greeks to invest in Ethiopia's agriculture, technology, textile and export industries. Ambassador Patakias recently stated in the local media that trade between the two countries has risen from 12 million euros (roughly $14.7m today) in 2013 to 22.5 euros million (roughly $27.6m today) in 2016, and he expects it to increase at an even faster rate over the next few years.\r\nFilippos Gembiaou at the Santorini Greek Restaurant [Thomas Lewton/Al Jazeera]\r\n'Magical culture'\r\nBut Gembiaou makes it clear she didn't set up her restaurant solely for business reasons.\r\n\"It's our house and we invite people in. As you've seen this place doesn't feel like a restaurant - you're only reminded it is when you have to pay before you leave,\" she says, adding, \"It's the soul of this place that makes it Greek.\"\r\n\"Ethiopian culture is something magical for me and I still haven't discovered it all yet,\" explains Gembiaou, who sees many similarities between the two cultures.\r\n\"First there's the religion which gives you a culture, even if you don't believe. The fact that Ethiopia was never colonised is also important. They are very proud, as the Greeks are of how they freed their heritage from the Ottomans. So that makes our connection stronger.\"\r\nThe restaurant owner goes on to highlight more day-to-day cultural similarities.\r\n\"Ethiopian and Greek TV dramas are similar. And coffee culture - we can both meet for coffee and pass three hours talking without realising it,\" she says with a laugh.\r\nGembiaou's initial reason for visiting Ethiopia was personal. \"After my father died we discovered among his personal things that we have a brother here who he left behind, so I came to find him,\" she explains.\r\nGembiaou found her brother - and even ended up marrying the Ethio-Greek who helped her locate him. The two have one child together, though they are now divorced.\r\nA captain in the Royal Ethiopian Navy, Barbara and Filippos' Ethiopian father travelled to Greece to train as part of a bilateral agreement between the two countries. He later went on to set up the first Ethiopian restaurant in the country.\r\n\"My father was one of the committee to sign the contract between the two navies 60 years ago,\" Gembiaou says with pride.\r\nShe adds this is particularly relevant today as the during the Greek minister's visit a similar agreement will be signed, giving young Ethiopian seafarers the opportunity to work on Greek vessels.\r\nGembiaou pauses for a minute and then adds: \"I feel extremely happy about this because for me it's like history making circles.\"\r\nThe Greek Club in Addis Ababa, Ethiopia [Thomas Lewton/Al Jazeera]","Ethiopia-Eritrea conflict, 20 years on: Brothers still at war":"The Ethiopian-Eritrean conflict of 1998-2000 erupted 20 years ago today, when the two countries went to war over the scrubby and desolate plains of Badime that are hardly useful for anything. Prime Minister Meles Zenawi of Ethiopia and President Isaias Afwerki of Eritrea, former comrades-in-arms who fought side by side and defeated one of Africa's largest and best-trained armies, morphed into absolutists. Belligerent narratives swiftly became dominant, causing a structural breakdown of communications between the two countries.\r\nThe result was a bloody and senseless WWI-style trench war in which tens of thousands of soldiers ran into machine guns, tanks and artillery fire in waves. The war left an estimated 100,000 dead and more than a million displaced.\r\nThe war also had a devastating effect on the social fabric and the economy of the two countries. Both countries resorted to nationalist framings of identity, territory, and shared history, precipitating conflicting narratives. Both countries diverted scarce resources from vital public services and developmental endeavours into weapons procurement.\r\nAt the height of the war, Ethiopia increased the total size of its army from 60,000 to 350,000 and increased its defence expenditure from $95m in 1997/98 to $777m in 1999/2000. Overall, the cost of the war for Ethiopia was nearly $3bn.\r\nIn the meantime, the size of Eritrea's army increased to 300,000 (almost 10 percent of the population) through National Service Conscription following the outbreak of the war, and the government has been using the intractable stalemate between the two countries as a justification not to demobilise the unsustainably high number of troops for a small nation like Eritrea.\r\nConflicting interests, hegemonic aspirations\r\nThe outbreak of the war between the two countries was universally described as astonishing and bewildering. Scholars and commentators across the world, exasperated by the senselessness of the conflict over an imaginary line that runs through the craggy piece of land, offered various explanations ranging from Eritrea's economic woes to the divergent ideologies between the leadership of the two countries and Ethiopia's desire to regain access to the sea.\r\nWhat is clear, however, is that the border dispute that was presented as the official reason behind the outbreak of the war was simply a mask for other much deeper and complex problems and hegemonic aspirations. \r\nAlthough officially an armed conflict between two sovereign nations, the Ethiopian-Eritrean War was largely viewed as a conflict between the ruling elites belonging to Peoples' Front for Democracy and Justice (PFDJ) and the Tigray Peoples Liberation Front (TPLF), the two political movements which dominated the politics of the two countries at the time. At most, it is a conflict between the Tigrinya speaking people of the Eritrean highlands, and the Tigrayans of Ethiopia. As Gerbru Asrat, former Politburo member of the TPLF observed, \"only Tigray, not the whole of Ethiopia, is Eritrea's target.\"\r\nThough the underlying political and economic differences were far from being insurmountable, the animosity, rage, scorn and bitterness between these two movements and their leadership made a political resolution impossible.\r\nThe Algiers Agreement\r\nAfter the fall of Badme to Ethiopia, the series of international mediation efforts within the Organization of African Unity and other multilateral organisations culminated in the adoption by the two countries of the Algiers Peace Agreement. In June of 2000, the two countries agreed to \"permanently terminate military hostilities\" and establish a \"neutral Boundary Commission\" that will have full authority to delimit and demarcate the boundaries. The peace treaty, which was also signed by the United States, the European Union, the African Union, and the United Nations, as guarantors, authorised the Commission to issue a \"final and binding\" decision. In April 2002, the Boundary Commission rendered its decision, ruling that the flashpoint town of Badme is part of Eritrea. Ethiopia refused to comply with the decision, setting the stage for a stalemate that still reverberates across the Horn of Africa.\r\nIntractable predicament\r\nThe political stalemate that ensued from the war and stubbornly persisted for two decades proved to be exclusivist and alienating. The conflict shattered family lives of millions of people on both sides of the border. It deprived landlocked Ethiopia of access to Eritrean ports. It cut off Eritrea from access to the largest market in the region. Both countries diverted massive resources from their already meagre budgets for military activity and still have thousands of troops manning their borders. In pursuit of their respective interests, the two countries engaged in hostile activities against one another, making a rapprochement even more difficult.\r\nThe dispute between the two countries has also been a vital factor of intractability for the Horn of Africa region. In 2006, Ethiopia sent troops to Somalia to fight the Islamic Courts Union. Although Ethiopia's targets were Eritrean advisors in Mogadishu and Ethiopia's concern about the long-term consequences of Eritrean influence in Somali politics, Ethiopia announced the war as part of the \"global war on terror\" to garner US financial and diplomatic support. The US fell for the ruse and became a key sponsor of Ethiopia's mission.\r\nDespite the intensity of the hostilities, the political landscaping is shifting, and there is a growing recognition by all the parties that the status quo is unsustainable.\r\n  Driven by both domestic and regional considerations, Ethiopia sought to build a reputation as a critical partner in the \"global war on terror\", becoming a key ally of the West and one of the top recipients of the Counterterrorism Partnership Fund and the Department of State's East Africa Regional Strategic Initiative. Ethiopian leaders used this alliance with the West to isolate and contain Eritrea, playing a key role in the 2009 US-sponsored UN arms sanction against Eritrea imposed for its alleged support of \"terrorist\" movements. Although a UN panel of experts found no evidence of Eritrean support and recommended the lifting of the sanctions, the Security Council extended the sanctions in November 2017. \r\nIn 2016, Eritrea reportedly leased the Port of Asab to the United Arab Emirates (UAE) who set up a military base there. Although Eritrea denied the report, there are credible claims that UAE is developing the base and using it for the war effort in Yemen.\r\nDespite the intensity of the hostilities, the political landscaping is shifting, and there is a growing recognition by all the parties that the status quo is unsustainable.\r\nUnique opportunities\r\nIn a gesture of reconciliation, Ethiopia's brand-new prime minister, Abiy Ahmed, expressed his readiness to resolve the differences between the two countries through dialogue. \"With the government of Eritrea,\" he said, \"we want from the bottom of our hearts that the disagreement that has reigned for years to come to an end.\" Prime Minister Abiy Ahmed, from the Oromo ethnic group, has a unique chance of ending the stalemate and opening a new chapter towards a peaceful coexistence by highlighting the transformative economic and social opportunities peace would bring both sides. He does not have the baggage that Meles Zenawi had and has a much better room for manoeuvre than his predecessor, Hailemariam Desalegn.\r\nHowever, the real test he faces is going beyond reconciliatory gestures or diplomatic pleasantries attempted by his predecessors. Most importantly, Abiy must commit Ethiopia to full compliance with the Commission's decision and reverse Ethiopia's legally and politically unsustainable position on Badme. He must send a clear signal to the Eritreans and the international community that Ethiopia will honour its end of the deal. Eritrea has the weight of an internationally binding judgement on its side and is right to demand Ethiopia's compliance with that decision.\r\nThis would serve as a critical confidence-building measure between the two countries, and would pave the way towards the complex and gruelling task of working through the political and economic conditions that led to the war that ripped the fabric of the two societies apart.\r\nThere is also a change in attitude in Washington and Brussels. On April 22, Undersecretary of State for African Affairs Donald Yamamoto visited Eritrea and there are reports that the current administration is open to talks. Europeans have already begun engaging with the Eritrean government. Under pressure to address the refugee crisis, they have been engaging the government and they would not hesitate to end the sanctions and support a peace initiative between the countries.\r\nThe peaceful resolution of the Ethiopian and Eritrean conflict would strengthen regional stability and restore confidence and resilience to the economy of both countries. It is imperative for all those who care about the long-term stability and economic viability of the region to do everything they can to help the two countries move beyond the senseless war that wrought so much suffering on both people.\r\nThe views expressed in this article are the author's own and do not necessarily reflect Al Jazeera's editorial stance.","Reflections on Tana Forum 2018 and Ethiopia's new PM Abiy Ahmed":"\"This new guy - he's a good guy. Very good brain. Now everything in Ethiopia is going to be OK\".\r\nMy taxi driver Daniel offers up this unprompted insight as we zip through the streets of Addis Ababa, letting me in on the sentiment around the unprecedented year Ethiopia had. \r\nThe \"new guy\" is Dr Abiy Ahmed, the recently selected chair of the Ethiopian People's Revolutionary Democratic Front (EPDRF), the coalition that has been ruling Africa's second-most populous country for 27 years. At 42 years old, Dr Ahmed is not just the youngest Ethiopian prime minster ever, but also the first from the Oromo community, the largest ethnic group in the country. For Daniel and others who offered their unprompted opinions, Dr Ahmed not only offers respite from nearly two years of political and social upheaval that threatened to undo Ethiopia altogether, but the hope of a more inclusive and democratic Ethiopia.\r\nEarlier in the week, Dr Ahmed offered the keynote address at the Tana High Level Forum on Peace and Security in Africa, an annual event held in the resort city of Bahir Dar, the State Capital of the Amhara region. Similar to the Davos World Economic Forum, the event brings together current and former political and academic leaders on the continent for an informal dialogue on enhancing peace and security on the continent. At the margins of the summit, hundreds of bilateral meetings between regional politicians, Addis Ababa's vast diplomatic corps and numerous international organisations make this one of the more significant networking events at the continent.\r\nOPINION\r\nA tough road ahead for Ethiopia's new leader Abiy Ahmed\r\nby Awol K Allo\r\nBahir Dar was a stopover for Dr Ahmed in the midst of a whirlwind tour of Ethiopia, uneasily calm after years of intensifying unrest that implicated three of the country's largest regions - Amhara, Oromia and the Somali region. The prime minister arrived at the forum after visiting Gondar, a historical town known for its 15th and 16th century churches and distinct orthodox Christian crosses that was the epicentre of many protests in the previous two years. By the time Ahmed arrived in Bahir Dar, internet access in the town had only just been restored after a nearly two year shut down.\r\nThe air in Bahir Dar was electric with anticipation of Ahmed's arrival, with everyone waiting to hear what he has to say. \"He's very young,\" said one driver, \"but he's very clever. He is [a] doctor, you know?\" \r\nAt the summit and beyond, expectations on Ahmed's shoulders are high. Both Amhara where the forum is held and Oromia where Dr Ahmed is from have seen intense political upheaval that analysts argue may have broken Ethiopia altogether. It began with an ambitious plan to relocate poor residents of Oromia to facilitate the expansion of the capital Addis Ababa. As there would be no compensation for those displaced, a cycle of protests and state oppression began in Oromia, culminating in the alleged massacre of over 500 people at the Ireecha or Oromo New Year celebrations in 2016. Similar protests in the Amhara and Somali region soon began as a cry for greater political representation for groups, triggering unprecedented changes in the country's leadership. Final numbers are unclear, but the Addis Standard alleges that hundreds have died and at least one million Ethiopians have been displaced in the chaos.\r\nIn contrast to earlier speeches in parliament and at various stops on his tour, at the summit Dr Ahmed's speech did not touch on Ethiopia's political flux, but the symbolism of his visit is unmissable for Ethiopian watchers.\r\nOutside Ethiopia, Bahir Dar's most famous son is Eskinder Nega, a journalist who had, until March, been in prison for seven years because of his criticism of the EPRDF regime. According to the Committee to Protect Journalists, Nega was at one point the longest held journalist in the world and the recipient of numerous awards recognising him as a prisoner of conscience.\r\nOPINION\r\nAn eastern problem for Ethiopia's new leader\r\nby Harry Verhoeven\r\nNega's treatment over the last three months is symbolic of the uncertainty within the EPRDF as to how Ethiopia will be moving forward: that the country seems eager to embrace the new possibilities of freedom but apparently unsure of how to do things differently. In February 2018, Dr Ahmed's predecessor, former Prime Minister Hailemariam Desalegn unexpectedly announced the release of Nega and hundreds of other political prisoners. The announcement was at first met with scepticism and then unbridled joy as it seemed that years of advocacy was finally bearing fruit. Since he assumed power in 2012, Desalegn, a deeply religious engineer, was expected to merely continue the EPRDF's history of suppression and state violence, not to carve out a political path for himself as an individual. In fact, in news media outside Ethiopia, the announcement was perhaps the first time Desalegn was discussed as an individual and not as the head of an amorphous, bloody political machine.\r\nEthiopian news outlets quickly backtracked on the announcement, insisting that Desalegn had been misquoted and that only some political prisoners would be released. But the announcement seemed to prompt a leadership crisis in Ethiopia, particularly as it was soon followed with the announcement of his resignation. Then, silence, as the internal machinery of the party retreated and regrouped. From an analytical perspective, we expected a small blip - it would soon be business as usual in Ethiopia - only for Desalegn to once again order the prisoner's release and then actually resign.\r\nFor Ethiopians, Ahmed's identity and intelligence, as well as the unprecedented changes he has overseen since taking office on April 2, suggest that change is imminent.\r\n  Barely a month after his release, Nega and other journalists attending an informal gathering at a private residence were arrested and sent to the infamous Maelekawi prison. Even while footage of Ahmed giving a stirring speech in parliament promising a new Ethiopia remained fresh, distressing images of the detainees in cramped cells quickly made the rounds on social media. The opprobrium and disappointment was quick - was everything that Ahmed promised a lie? \r\nIn fact, it was yet another symptom that after 27 years in power, the EPRDF had developed an internal modus operandi that didn't necessarily require the participation of the sitting leader to keep moving. Although no effort was made to disguise the fact of their arrest, after another two weeks, Nega and other journalists were released and according to local media, Maelekawi was closed for good. Yet two days before the Forum, Nega was scheduled to fly to New York to receive an award from Amnesty International and Ethiopian activists allege that his passport was confiscated and he was denied travel, only to have it permitted less than 48 hours later. \r\nNone of this is discussed in the public discussions at the forum, even though it is held while a state of emergency is still in place and in the context of a policy of absolute candour. In fact, the public winner in the race for diplomatic access to Ethiopia's new leader is Omar el-Bashir, the president of Sudan indicted for crimes against humanity at the International Criminal Court, who jetted in for the summit but barely attended. There were quiet meetings between the two men, perhaps to establish diplomatic channels in the face of an increasingly complex relationship. Ethiopia's relationship with joint neighbour Eritrea remains hostile - they share the most militarised border on the continent, even while Eritrea and Sudan have warm relations. Yet the recent upswing in base building by foreign countries like China, France and the US, particularly in neighbouring Djibouti and Somalia has created an unexpected common cause between the two countries. Also, tensions between Egypt and Sudan over a shared border and the use of the waters of the Nile - which rises in both Ethiopia and Sudan - increase the need for diplomatic coordination between Ethiopia and Sudan. Bashir is the only other sitting African leader at the forum, signalling an urgency to connect with Ahmed at the seat of the African Union, a partner of the Forum.  \r\nSome of these issues do make it onto the discussion, in an unexpected way. Desalegn is an unmissable figure, not least because of his staggering height and distinct moustache. When he speaks, he offers some of the most unambiguous defence of human rights on the continent and suggests that the militarisation of the Red Sea should be a security priority for the African Union at a session that periodically drifted into empty, bureaucratic jargon. Despite Ethiopia's reputation for suppression of the public sphere, he eloquently makes the case for a robust response from the AU to ongoing crises in the region. At the end of the forum, young staffers from the hotel scramble for selfies and handshakes and although he still has security, Desalegn allows them to approach and smiles broadly for all the cameras. \r\nWhere has this guy been since 2015? \r\nDesalegn declined to comment for this piece but his affable, congenial presence at the Forum suggests that he may be positioning himself for an elder-statesman role, similar to that played by the Forum's outgoing chair, former Nigerian President Olesegun Obasanjo. In a region beset by leaders increasingly reluctant to peacefully concede power, his decision to resign allows him to easily leap over the admittedly low bar of what constitutes good governance in East Africa. He has already received the Ethiopian Medal of Honour - the highest civilian honour in the country. However, of Ethiopia's well documented economic growth, Daniel the taxi driver told me \"buildings, buildings everywhere in Addis Ababa but we cannot eat buildings!\" Apparently, Desalegn resigned just as Ethiopians had finally had enough of economic growth without meaningful progress.\r\nMeanwhile his successor carries the weight of knitting together a country that, despite breakneck economic growth and pride of place on the continent's political hierarchy, was careening towards revolution. For Ethiopians, Ahmed's identity and intelligence, as well as the unprecedented changes he has overseen since taking office on April 2, suggest that change is imminent.\r\nIn one plenary session at the Forum, Nigaria's 80-year old former President Olesegun Obasanjo chastised a pair of young men who had been offered a chance to address the forum as a prize for winning an essay competition. \"You cannot speak for your country,\" he insisted, \"you can only speak for your colleagues. Wait your turn!\" Ironically, a 42-year-old former soldier with a PhD in Peace Studies who refused to wait his turn is now responsible for fundamentally reforming the country where he was speaking. \r\nThe views expressed in this article are the author's own and do not necessarily reflect Al Jazeera's editorial stance.","Ethiopia's new prime minister names cabinet":"Ethiopia's new prime minister has named a cabinet that includes the former mining minister as defence minister, and retained the finance and foreign ministers from his predecessor's cabinet.\r\nAbiy Ahmed, who was appointed by Ethiopia's ruling coalition last month and sworn in as prime minister on April 2, made the announcement on Thursday on state television.\r\n\"I am requesting parliament to ratify the reshuffle of six ministers and the new appointment of 10 others,\" Ahmed, a former army officer, said. The remaining ministers from the previous cabinet, including finance and foreign affairs, were unchanged.\r\nThe 16-member cabinet includes six names from the previous government of his predecessor Hailemariam Desalegn who resigned in February. \r\nHailemariam resigned following months of protests in the Oromia and Amhara region that led to the deaths of hundreds of people.\r\nThe protests, which initially began over land rights, but later broadened to include calls for greater political representation at the national level, met a harsh government response.\r\nEthiopia in February declared its second state of emergency in two years amid the ongoing protests that effectively crippled transportation networks and forced the closure of businesses.\r\nIn August 2017, Ethiopia lifted a 10-month state of emergency imposed after hundreds of people were killed in anti-government protests.\r\nThe country's Oromo and Amhara people - who make up about 61 percent of the population - have staged mass demonstrations since 2015 calling for greater political inclusion and an end to human rights abuses."}